# # 算术运算符 : + - * / // % **
# print("10 + 4 = ",10 + 4) # 加
# print("10 - 4 = ",10 - 4) # 减
# print("10 * 4 = ",10 * 4) # 乘
# print("10 / 4 = ",10 / 4) # 除
# print("10 // 4 = ",10 // 4) # 整除(除数为整数)
# print("10 % 4 = ",10 % 4) # 取余/求模
# print("10 ** 4 = ",10 ** 4)# 幂指数/10的4次方
#
# # 算术运算符优先级 ---> ** ---> * / // % ---> + -
# print(10 + 11 ** 8 * 2)
#
# # 案例1: 输入俩个数 x 和 y ,计算 x + y 以及 x - y 的结果并输出
# # float(..) --->
# x = float(input("请输入x的值:"))
# y = float(input("请输入y的值:"))
# print("x + y =,",x + y)
# print("x - y =,",x - y)

# 在涉及到浮点数的算术运算符时,可能会损失精度(因为计算机底层是基于二进制来进行数据的存储与处理,二进制是无法准确的表示所有的小数的)

# 赋值运算符 : = += -= *= /= //= %= **=
# num = 85
# print("num =",num)
#
# num += 10
# print("num += 10 后, num =",num) # num = 95
#
# num -= 10
# print("num -= 10 后, num =",num) # num = 85
#
# num *= 10
# print("num *= 10 后, num =",num) # num = 850
#
# num /= 10
# print("num /= 10 后, num =",num) # num = 85.0 /结果为浮点数,后续运算都为浮点数类型
#
# num //= 10
# print("num //= 10 后, num =",num) # num = 8.0 //结果为整数,后续运算都为整数类型
#
# num %= 3
# print("num %= 3 后, num =",num) # num = 2.0
#
# num **= 3
# print("num **= 3 后, num =",num) # num = 8.0

# 比较运算符: == != > >= < <= ------ 返回bool值(True,False)
print("100 == 100 吗:" , 100 == 100) #True
print("\"100\" == \"100\" 吗:" , "100" == "100") #True
print("100 != 100 吗:" , 100 != 100) #False

print("100 > 100 吗:" , 100 > 100) # False
print("100 >= 100 吗:" , 100 >= 100) # True

print("100 < 100 吗:" , 100 < 100) #False
print("100 <= 100 吗:" , 100 <= 100) # Ture

# 判断是否为偶数
#num % 2 == 0  偶数True 奇数False

# 逻辑运算符: and or not
# 案例1:键盘输入一个整数,判断这个数字是否在10-20之间 --> 在:True ,不在:False
num = int(input("请输入数字"))
print(f"{num}在10与20之间:" , num >= 10 and num <= 20) #and连续的条件是并且关系,俩个条件同时成立(True);否则(False)
print(f"{num}在10与20之间:" , 10 <= num <= 20)

# 案例2:键盘输入一个整数,判断这个数字不在10-20之间
n = int(input("请输入数字"))
print(f"{n}不在10-20之间:" , n < 10 or n > 20) #or连接的条件是或者的关系,只要其中有一个成立(True),结果就是(True),全部都不成立结果才是(False)


